# StairstypeMinimumTreadWidthInsideBoundary Property

---
C#Visual BasicVisual C++
Revit 2024 API
---
ParameterTypeId..::..StairstypeMinimumTreadWidthInsideBoundary Property
ParameterTypeId Class See Also
---
"Min. Tread Depth on Winder Inner Boundary": Minimum Tread Width on Inside Boundary
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static ForgeTypeId StairstypeMinimumTreadWidthInsideBoundary { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property StairstypeMinimumTreadWidthInsideBoundary As ForgeTypeId
	Get
```

Visual C++
---
```text
public:
static property ForgeTypeId^ StairstypeMinimumTreadWidthInsideBoundary {
	ForgeTypeId^ get ();
}
```

# See Also
ParameterTypeId Class
Autodesk.Revit.DB Namespace